def anamenü ():
    print(r"""
========================================
        O Y U N   M E N Ü S Ü          
========================================
[1] 🎮 Yeni Oyun
[0] ❌ Çıkış
========================================
""")


def zafer ():
    print(r"""
  ___________
 '._==_==_=_.'
 .-\:      /-.
| (|:.     |) |
 '-|:.     |-'
   \\::.    /
    '::. .'
      ) (
    _.' '._
   `-------`
 [ TEBRİKLER! ]
 [ KAZANDINIZ ]
""")
    

def yenilgi ():
    print(r"""
    .-"-.
   / 4 4 \\
   \_ v _/
   //   \\\\
  ((     ))
===""===""===
[ OYUN BİTTİ! ]
[ KAYBETTİNİZ ]
""")
    
def yenioyun ():
    print(r"""
========================================
        O Y U N   M E N Ü S Ü          
========================================
[1] ⚙️  Zorluk Seçimi (Kolay / Orta / Zor)
========================================
""")
    
def zorluk ():
    print(r"""
=======================================

[1] 🟢 KOLAY   -->  10 Tahmin Hakkı
[2] 🟡 ORTA    -->  7 Tahmin Hakkı
[3] 🔴 ZOR     -->  4 Tahmin Hakkı

=======================================
""")
        
def kurallar ():
    print(r"""
=======================================
               KURALLAR
=======================================

1. Bilgisayar 1 ile 100 arasında (1 ile 100 dahil) gizli 
   bir sayı belirler.
    
2. Seçtiğiniz zorluk derecesine göre 
   belirli bir tahmin hakkınız olur.
    
3. Yaptığınız tahminlere göre sistem sizi 
   [↑ YUKARI] veya [↓ AŞAĞI] yönlendirir.
    
4. Haklarınız tükenmeden gizli sayıyı 
   bulursanız oyunu kazanırsınız!

=======================================
""")
    
def yukarı ():
    print(r"""       
    /\ 
   /  \ 
  / /\ \ 
 / /  \ \ 
/_/    \_\ 
   |  |
   |  |   [ ↑ DAHA BÜYÜK BİR SAYI GİRİN ↑ ]
   |__|
""")
    
def aşağı ():
    print(r"""
  ____
 |    |
 |    |   [ ↓ DAHA KÜÇÜK BİR SAYI GİRİN ↓ ]
 |    |
_\    /_
\ \  / /
 \ \/ /
  \  /
   \/
""")
    
def tekrardene ():
    print(r"""
========================================
        O Y U N   M E N Ü S Ü          
========================================
[1] 🎮 Ana Menü
[0] ❌ Çıkış
========================================
""")
    
def çıkış ():
    print(r"""
=======================================
👋 Oynadığınız için teşekkürler.
       Tekrar görüşmek üzere!
=======================================
""")
    
def giriş ():
    print(r"""
 _____                _______      _               _          ___ __   _ _    _ _   _  _    _
/ ___|  __ _ _  __ _  |_   _|_ _  | |__  _ __ ___ (_)_ _     / _ \\ \ / / |  | | \ | || |  | |
\___ \ / _` | | | | |   | |/ _` | | '_ \| '_ ` _ \| | '_ \  | | | |\ V /| |  | |  \| || |  | | 
 ___) | (_| | |_| | |   | | (_| | | | | | | | | | | | | | | | |_| | | | | |__| | |\  || |__| |
|____/ \__,_|\__, |_|   |_|\__,_| |_| |_|_| |_| |_|_|_| |_|  \___/  |_|  \____/|_| \_| \____/
             |___/                                                                                                           
""")
    
def başlık ():
    print(r"""
========================================
[?]  SAYI TAHMIN OYUNUNA HOŞ GELDİNİZ [?]   
========================================
""")